      * Demonstrate http_XmlReturnPtr(*ON)
      * maybe a web service that downloads an XML document containing
      * a video, and the video is larger than 64k?
     c                   eval      *inlr = *on
